# SQLite in Python: Queries

<div class="alert alert-success">  

## Learning Objectives

- Have basic understanding of SQL syntax (e.g., `SELECT`, `FROM`, `WHERE` clauses).
- Write SQL queries to select, filter, and sort data.
- Perform complex joins between tables to retrieve related data.
- Use aggregate functions to summarize data.
</div>


### Icons Used in This Notebook
üîî **Question**: A quick question to help you understand what's going on.<br>
ü•ä **Challenge**: Interactive exercise. We'll work through these in the workshop!<br>
üí° **Tip:** How to do something a bit more efficiently or effectively.<br>
‚ö†Ô∏è **Warning:** Heads-up about tricky stuff or common mistakes.<br>

For the exercises below, you can find the [Solutions for Northwind SQLite Exercises here](SQL-Northwind-Lesson-Exercises.ipynb).

This notebook contains SQL queries derived from the exercises taken from:

**[SQLite Data Starter Packs](http://2016.padjo.org/tutorials/sqlite-data-starterpacks/#toc-simplefolks-for-simple-sql) | Public Affairs Data Journalism at Stanford | Fall 2016**

> This is a collection of public datasets conveniently packaged as SQLite databases to practice on.
> 
> You don‚Äôt have to worry about the data cleaning/import process, just download the SQLite database files and query them from your favorite SQLite client.

[See this simple database as a Google Spredsheet](https://docs.google.com/spreadsheets/d/1OzM6Sp92cDG_jkO4_WGEacuD0rwYF_g2kHOIuq6NgZM/view)

SQLite3 comes with Python's standard library, so no extra install is needed if you already have pandas.

If you need to install any missing libraries, uncomment and run the following commands:

In [ ]:
%load_ext sql

In [ ]:
%sql sqlite:///data/simplefolks.db

## Viewing: Select everything from the `people` table.

**Details**: Include all the columns and rows, order does not matter.

**Hint 1**: You can use `*` to include all columns of a given table.

**Hint 2**: By default, all rows in a specified table are selected.

In [ ]:
%%sql
-- # Query: Select everything from the `people` table.
SELECT * FROM people;

## Viewing: Select all the rows from `people, but list the columns in reverse sequence.

**Details**: Include all of the columns, but just in reverse order from how they're listed in the `people` table. 

**Hint 1**: Can't use `*`, as that will include all the columns in their default order.

**Hint 2**: Use commas to separate the field names in the SELECT clause.

In [ ]:
%%sql
-- # Query: Select all the rows from `people, but list the columns in reverse sequence.
SELECT age, sex, name
FROM people;

## Limiting: Select the first row from `pets`

**Details**: Include all the columns, but list only the first row.

**Hint 1**: LIMIT is pretty much the last clause in any SELECT query.

In [ ]:
%%sql
-- # Query: Select the first row from `pets`
SELECT *
FROM pets
LIMIT 1;

## Limiting: Select just the value of the first 3 `homes`

**Details**: Include only the `value` column for the first 3 rows

**Hint 1**: Select only the column that is required

**Hint 2**: LIMIT 3

In [ ]:
%%sql
-- # Query: Select just the value of the first 3 `homes`
SELECT value
FROM homes
LIMIT 3;

## Sorting: List pet and owner names, from `pets`, in alphabetical order of the pet's name

**Details**: The result should only have 2 columns, with the original headers of `name` and `owner_name`, in that order

In [ ]:
%%sql
-- # Query: List pet and owner names, from `pets`, in alphabetical order of the pet's name
SELECT name, owner_name
FROM pets
ORDER BY name;

## Sorting: List `homes` in order of area by alphabetical order, then by highest value.

**Details**: Include all columns. Interpret "highest" value to mean, list biggest numbers first, per area.

In [ ]:
%%sql
-- # Query: List `homes` in order of area by alphabetical order, then by highest value.
SELECT *
FROM homes
ORDER BY area ASC, value DESC;

## Sorting: List the 3 oldest `people`

**Details**: Include every column. Interpret "oldest" as: descending order of the age number.

**Hint 1**: Biggest first means "descending order"

**Hint 2**: LIMIT comes after ORDER BY

In [ ]:
%%sql
-- # Query: List the 3 oldest `people`
SELECT *
FROM people
ORDER BY age DESC
LIMIT 3;

## Filtering: List all the `people` younger than 30

**Details**: Include all columns. Order rows by ascending order of age.

**Hint 1**: WHERE goes after FROM

**Hint 2**: age < 30

In [ ]:
%%sql
-- # Query: List all the `people` younger than 30
SELECT *
FROM people
WHERE age < 30
ORDER BY age ASC;

## Filtering: List the 3 cheapest `homes` in the urban area.

**Details**: Include all columns

**Hint 1**: Use single-quotes to denote the literal value of 'urban'

**Hint 2**: WHERE homes = 'urban'

In [ ]:
%%sql
-- # Query: List the 3 cheapest `homes` in the urban area.
SELECT *
FROM homes
WHERE area = 'urban'
ORDER BY value ASC;

## Filtering: List every person between the ages of 30 and 50 (inclusive)

**Details**: Include all columns. You can use the BETWEEN keyword if you know it. Order the rows by age, ascending

**Hint 1**: Use `>=` and `<=` for "greater than or equal to" and "less than or equal to", respectively

**Hint 2**: Think of the age constraint as requring the age number to meet a lower bound AND an upper bound.

In [ ]:
%%sql
-- # Query: List every person between the ages of 30 and 50 (inclusive)
SELECT *
FROM people
WHERE age >= 30 AND age <= 60;

## Filtering: List every person younger than 35 or older than 65

**Details**: Include all columns. Order the rows by age, ascending.

**Hint 1**: Someone who is younger than 35 AND older than 65 is logically impossible.

**Hint 2**: A person can either have an age less than 35, OR, greater than 65.

In [ ]:
%%sql
-- # Query: List every person younger than 35 or older than 65
SELECT *
FROM people
WHERE age < 35 OR age > 65

### Key Points:

- Include all columns. Order the rows by age, ascending.

## Filtering: List the 3 most expensive homes that are neither in the country or owned by Donald nor Hillary.

**Details**: This isn't a particularly sophisticated (or useful) query. But there are so many ways to express this conditional statement that you could tie yourself up in **nots** `!=` (yes, silly pun with "knots").

**Hint 1**: You could get by with 3 uses of the `!=` operator.

**Hint 2**: Or, you could wrap up OR conditions usingparentheses, and negate the result of those conditions:

```sql
WHERE NOT(area = 'country' 
        OR owner_name IN('Donald', 'Hillary') 
```

In [ ]:
%%sql
-- # Query: List the 3 most expensive homes that are neither in the country or owned by Donald nor Hillary.
SELECT *
FROM homes
WHERE area != 'country'
AND owner_name != 'Donald'
AND owner_name != 'Hillary'
ORDER BY value DESC
LIMIT 3;

## Filtering: List all the 40-years-and-older men in `people`

**Details**: List all columns, order the rows by oldest age.

**Hint 1**: Use `=` to match literal string values, such as 'M' or 'F'

**Hint 2**: If we want both conditions in a boolean expression to be met, we don't use `OR`

In [ ]:
%%sql
-- # Query: List all the 40-years-and-older men in `people`
SELECT *
FROM people
WHERE sex = 'M'
AND age >= 40;

## Filtering: List the names of the pets that are owned by Sherry, Dani, and Zed.

**Details**: List the owner's name, then the pet's name, and order the rows alphabetically by the owner's name, then the pet's name.

**Hint 1**: Kind of a trick question: How we describe wanting the pets of this owner AND that owner in a normal sentence is NOT the same as we do in SQL.

**Hint 2**: Another way to say, "Pers owned by Sherry, Dani, and Zed" is: "Pets owned by either Sherry, Dani, OR Zed"

In [ ]:
%%sql
-- # Query: List the names of the pets that are owned by Sherry, Dani, and Zed.
SELECT owner_name, name
FROM pets
WHERE owner_name IN ('Sherry', 'Dani', 'Zed')
ORDER BY owner_name ASC, name ASC;

## Filtering: List the names of pets that are not cats.

**Details**: List only the name column in alphabetical order

**Hint 1**: Use `!=` to express "not equal to"

**Hint 2**: type != 'cat'

In [ ]:
%%sql
-- # Query: List the names of pets that are not cats.
SELECT name
FROM pets
WHERE type != 'cat';

## Filtering: List the pets, name and type, that are neither dogs nor cats

**Details**: List the name and type of pet, ordered by type and name alphabetically.

**Hint 1**: You can use `!=` with `AND`

**Hint 2**: IN('dog', 'cat'), with NOT in front to negate it, will also work.

In [ ]:
%%sql
-- # Query: List the pets, name and type, that are neither dogs nor cats
SELECT name, type
FROM pets
WHERE type != 'cat' AND type != 'dog'
ORDER BY type, name;

## Transforming: List the first letter of each person's name in `people`

**Details**: The result set should have one column. No need to specify order of rows.

In [ ]:
%%sql
-- # Query: List the first letter of each person's name in `people`
SELECT SUBSTR(name, 1, 1)
FROM people;

## Transforming: List the combined length of owner name and pet name in `pets`

**Details**: Just list a single column, any order.

**Hint 1**: You can add (or subtract, etc) the result of function calls to each other

In [ ]:
%%sql
-- # Query: List the combined length of owner name and pet name in `pets`
SELECT LENGTH(name) + LENGTH(owner_name)
FROM pets;

## Transforming: List the uppercased first 3 letters of a politician's first name and their uppercased last name

**Details**: 2 columns named "first_letters" and "last_name", in alphabetical order of last name, then first_letters

**Hint 1**: Use the UPPER function to uppercase a value.

**Hint 2**: Use SUBSTR to excerpt a string value.

In [ ]:
%%sql
-- # Query: List the uppercased first 3 letters of a politician's first name and their uppercased last name
SELECT
SUBSTR(UPPER(first_name), 1, 3) AS first_letters,
UPPER(last_name) AS last_name
FROM politicians
ORDER BY last_name, first_letters;

## Transforming: List the 5 pets whose names are longer than their owners', in order of greatest difference.

**Details**: List 3 columns: name, owner_name, and name_diff

**Hint 1**: Subtract the LENGTH of one name against the other to get the difference.

**Hint 2**: Use a WHERE clause to filter the selection for pets whose names are longer than their owners.

In [ ]:
%%sql
-- # Query: List the 5 pets whose names are longer than their owners', in order of greatest difference.
SELECT
name, owner_name,
LENGTH(name) - LENGTH(owner_name) AS name_diff
FROM pets
ORDER BY
name_diff DESC
LIMIT 5;

## Transforming: List the names, and also the ages of each politician derived from `birth_year` (assuming the current year is 2016)

In [ ]:
%%sql
-- # Query: List the names, and also the ages of each politician derived from `birth_year` (assuming the current year is 2016)
SELECT first_name, last_name,
(2016 - birth_year) AS age
FROM politicians
ORDER BY age DESC;

## Transforming: Get the decade of birth of each politician.

In [ ]:
%%sql
-- # Query: Get the decade of birth of each politician.
SELECT
first_name, last_name,
(birth_year / 10) * 10 AS birth_decade
FROM politicians
ORDER BY birth_decade ASC, last_name, first_name;

## Transforming: List the value of the `homes` in thousands of dollars

In [ ]:
%%sql
-- # Query: List the value of the `homes` in thousands of dollars
SELECT (value / 1000)
AS value_k
FROM homes
ORDER BY value_k;

## Aggregating: Count the number of politicians.

**Details**: List one column named pcount.

In [ ]:
%%sql
-- # Query: Count the number of politicians.
SELECT COUNT(*) AS pcount FROM politicians;

## Aggregating: List the values of the most expensive and cheapest `homes`.

**Details**: List 2 columns, `most_expensive` and `cheapest`

In [ ]:
%%sql
-- # Query: List the values of the most expensive and cheapest `homes`.
SELECT MAX(value) AS most_expensive,
MIN(value) AS cheapest
FROM homes;

## Aggregating: Fromn `people`, List the rounded, average age of `people`, and also the difference between the oldest and youngest.

**Details**: List 2 columns, `rounded` and `diff_age`

In [ ]:
%%sql
-- # Query: Fromn `people`, List the rounded, average age of `people`, and also the difference between the oldest and youngest.
SELECT ROUND(AVG(age)) AS rounded_age,
MAX(age) - MIN(age)
FROM people;

<a id='resources'></a>
## Additional Resources

- **SQLite Documentation:** [https://www.sqlite.org/docs.html](https://www.sqlite.org/docs.html)
- **SQLite Command Line Reference:** [https://www.sqlite.org/cli.html](https://www.sqlite.org/cli.html)
- **SQL Tutorial Cheatsheet:** [https://www.sqltutorial.org/sql-cheat-sheet/](https://www.sqltutorial.org/sql-cheat-sheet/)
- **SQLite Browser Wiki:** [SQLite Browser GitHub Wiki](https://github.com/sqlitebrowser/sqlitebrowser/wiki)
- **Northwind SQLite Repo:** [Github Repo](https://github.com/jpwhite3/northwind-SQLite3/)
- **Northwind Database Schema:** [Schema Diagram](https://github.com/jpwhite3/northwind-SQLite3/blob/main/docs/Northwind_ERD.png)